## what will be the output of the following  python program

In [1]:
def foo(x):
    x[0]=['def']
    x[1]=['abc']
    return id(x)
q=['abc','def']
print(id(q)==foo(q))

True

The foo function modifies the first two elements of the input list x and sets them to new lists ['def'] and ['abc'], respectively. It then returns the identity of the modified list x. The print statement compares the identity of the original list q with the result of calling foo(q). The comparison checks if they refer to the same object in memory

## what will be the output of the following  python code?

In [2]:
def fun():
    try:
        return 1
    finally:
        return 2
k= fun()
print(k)

2

* The fun function has a try block with return 1 and a finally block with return 2.
* The finally block always executes, overriding the return 1 in the try block.
* When calling fun(), it returns 2 due to the return 2 in the finally block.
* The assigned value k is 2.
* Printing k will output 2.

## what will be the output  of the following code snippet?

In [3]:
def func():
    global value
    value = 'Local'
value = 'Global'
func()
print(value)

Local

* Initializes a global variable value with the value 'Global'.
* Defines a function func that uses the global keyword to declare that the variable value within the function refers to the global scope. Inside the function, it sets the value of the global variable value to 'Local'.
* Outside the function, calls func() to execute it.
* Prints the current value of the global variable value using print(value).

## 4.  ___________ exceptions are raised as result of an error in opening a particular file

IOError

## 5. In python we do not specify types ,it is directly interpert by the complier, so consider the following operation to be performed

a) x =13/2 

b) x=int(13/2)

c) x= 13%2

D) All Of  the mentioned

In [4]:
13//2

6

In [5]:
int(13//2)

6

In [6]:
13%2

1

### answer : D) All Of the mentioned

## 6.what willl be the out put of the follwing Python code?

In [7]:
#t[5] # name error

a)IndexError

b)NameError

c)TypeError

d)SyntactialError

## 7. A while loop in python is used for what type of iteration

a) indefinite

b) discriminant

c) definite

d) indeterminate

while loop is used for indefinite iteration, With the while loop we can execute a set of statements as long as a condition is true.

### syntax:

while condition:

    # body of while loop

In [8]:
i= 1
while i < 5:
    print(i)
    i+= 1

1
2
3
4

## 8. What will be the output of the following python code?

In [9]:
x = "abcdef"
while i in x:
    print(i, end=" ")

TypeError: 'in <string>' requires string as left operand, not int

will raise a **NameError** because the variable i is not defined before being used in the loop condition.

In [10]:

x = "abcdef"
i = 0
while i < len(x):
    print(x[i], end=" ")
    i += 1

a b c d e f

## 9. what is main advantage of using decorators in python?

a) they make code more complex

b) they simplify the syntax of the decorated function

c) they reduce the performance of the code

d) they provide additional security features

* Decorator is one of the Function which will provides Additional Processing capability to the normal Function value and returns the modified value.

* A Decorator Function is always takes Normal Function as parameter

### b) they simplify the syntax of the decorated function

## 10. if return statement is not used inside the function , the function will return


a)None

b)0

c)Null

d)Arbitary value

#### None

## 11.what is called when function is defined inside a class?

a) class

b) Function

c)method

d)Module

When a function is defined inside a class, we call it a **Method**

## 12. which operator is used in python to import modules from a package?

a)•

b)*

c)->

d)&

## 13.

In [11]:
def getMonth(m):
    if m < 1 or m>12:
        raise ValueError("Invalid")
    print(m)
getMonth(6)

6

The getMonth function takes an argument m, which represents a month. It checks if the value of m is less than 1 or greater than 12. If either condition is true, it raises a ValueError with the message "Invalid." Otherwise, it prints the value of m.

## 14. In python programing language , syntax error is detected  by ________at_______

a) interpreter / compile time

b) Runtime /interpreter

c)interpreter/Run time

d)compile time /Run time



### a) interpreter / compile time

## 15

In [12]:
class Book:
    def __init__(self,author):
        self.author = author
book1 = Book('V.M.Shah')
book2 = book1

a)Both book1 and book2 will have reference to two different objects of class Book

b)id(book1) and id(book2) will have same value

c)it wil throw error as multiple reference  to same object is not possible

d) None of the above

In [13]:
id(book1)

2266623470320

In [14]:
id(book2)

2266623470320

### b)id(book1) and id(book2) will have same value

## Module - Data Analysis

In [15]:
import pandas as pd


data = {
    'Date': ['2024-01-01', '2024-01-02', '2024-01-03','2024-01-10','2024-01-09','2024-01-08'],
    'Category': ['Beverage', 'Food', 'Beverage','Beverage','Beverage','Food'],
    'Product': ['Cappuccino', 'Croissant', 'Espresso','Latte','Latte','Muffin'],
    'Customer_id': ['C004','C002','C001','C001','C003','C002'],
    'Quantity': [1, 2, 2,3,1,1],
    'UnitPrice': [3, 2,2,3.5,3.5,2.5]}


df = pd.DataFrame(data)
df

         Date  Category     Product Customer_id  Quantity  UnitPrice
0  2024-01-01  Beverage  Cappuccino        C004         1        3.0
1  2024-01-02      Food   Croissant        C002         2        2.0
2  2024-01-03  Beverage    Espresso        C001         2        2.0
3  2024-01-10  Beverage       Latte        C001         3        3.5
4  2024-01-09  Beverage       Latte        C003         1        3.5
5  2024-01-08      Food      Muffin        C002         1        2.5

##  How to create a new column "Revenue" which has value equal to the Quantity * UnitPrice" of the current row?

In [16]:
df['Revenue'] = df['Quantity'] * df['UnitPrice']

In [17]:
df

         Date  Category     Product Customer_id  Quantity  UnitPrice  Revenue
0  2024-01-01  Beverage  Cappuccino        C004         1        3.0      3.0
1  2024-01-02      Food   Croissant        C002         2        2.0      4.0
2  2024-01-03  Beverage    Espresso        C001         2        2.0      4.0
3  2024-01-10  Beverage       Latte        C001         3        3.5     10.5
4  2024-01-09  Beverage       Latte        C003         1        3.5      3.5
5  2024-01-08      Food      Muffin        C002         1        2.5      2.5

## What is the syntax to find Categorical wise revenue?

In [18]:
df.groupby('Category')['Revenue'].sum()

Category
Beverage    21.0
Food         6.5
Name: Revenue, dtype: float64

## Tofind the average quantity wrt to date and product ,what is the correct syntax?

In [19]:
df.groupby(['Date', 'Product'])['Quantity'].mean()

Date        Product
2024-01-01  Cappuccino    1.0
2024-01-02  Croissant     2.0
2024-01-03  Espresso      2.0
2024-01-08  Muffin        1.0
2024-01-09  Latte         1.0
2024-01-10  Latte         3.0
Name: Quantity, dtype: float64

## Categorical wise revenue for Beverage and food respectively are

In [20]:
df['Revenue'] = df['Quantity'] * df['UnitPrice']

In [21]:
beverage_rev = df[df['Category'] == 'Beverage']['Revenue'].sum()
beverage_rev

21.0

In [22]:
food_rev = df[df['Category'] == 'Food']['Revenue'].sum()
food_rev

6.5

## 20. Using transform ,what is the syntax to create a column which has a unitprice difference wrt its category  mean?

In [23]:
df.groupby('Category')['UnitPrice'].transform(lambda x: x - x.mean())

0    0.00
1   -0.25
2   -1.00
3    0.50
4    0.50
5    0.25
Name: UnitPrice, dtype: float64

## 21. What is the correct syntax to get data wrt 'Monday'?

In [24]:
df['Date'] = pd.to_datetime(df['Date'])

In [25]:
df.groupby(df.Date.dt.day_name()).get_group('Monday')

        Date  Category     Product Customer_id  Quantity  UnitPrice  Revenue
0 2024-01-01  Beverage  Cappuccino        C004         1        3.0      3.0
5 2024-01-08      Food      Muffin        C002         1        2.5      2.5

## 22. which of the following statement is/are True?

a) apply() can be applied on rows

b) Apply function can't be applied on rows

c)Apply applies the function on the entire series at a time

d)Apply applies the function one cell at a time

### a) apply() can be applied on rows
### c)Apply applies the function on the entire series at a time

* The apply() function in pandas can be used to apply a function along the axis of a DataFrame or Series. By default, if you apply it to a Series, it operates on each element of the Series. If you apply it to a DataFrame, you can specify whether the function should be applied to rows (axis=0) or columns (axis=1).

* apply() can be applied on rows if you set the axis parameter accordingly.

## 23. Which of the following statement is/are True ?

a) Map applies the functionality on the entire DataFrame

b)Applymap applies the functionality on series  be it row or a column

c) Apply and map are vectorized applications

d) None of the above

#### d.None of the above

In [26]:

data = {
    'Date': ['2024-01-10', '2024-01-11', '2024-01-10','2024-01-12','2024-01-11','2024-01-12'],
    'Region': ['North', 'South', 'East','West','North','East'],
    'Salesperson': ['Ajay', 'Balu', 'Chirag','Ajay','Balu','Chiraj'],
    'Product': ['Notebook', 'Pen', 'Notebook','Pen','Binder','Binder'],
    'Quantity': [5, 10, 7,15,20,10],
    'UnitPrice': [12, 3, 12,3,5,5]
}

df1= pd.DataFrame(data)

df1

         Date Region Salesperson   Product  Quantity  UnitPrice
0  2024-01-10  North        Ajay  Notebook         5         12
1  2024-01-11  South        Balu       Pen        10          3
2  2024-01-10   East      Chirag  Notebook         7         12
3  2024-01-12   West        Ajay       Pen        15          3
4  2024-01-11  North        Balu    Binder        20          5
5  2024-01-12   East      Chiraj    Binder        10          5

## 24. what is the syntax to create a pivot table with index as North  and south and columns as product where values are sun of Quantities sold?

In [27]:
df1[df1['Region'].isin(['North', 'South'])].pivot_table(index='Product', columns='Region', values='Quantity', aggfunc='sum')

Region    North  South
Product
Binder     20.0    NaN
Notebook    5.0    NaN
Pen         NaN   10.0

In [28]:
df1[(df1['Region'] == 'North') | (df1['Region'] == 'South')].pivot_table(index='Product',columns='Region',values='Quantity',aggfunc='sum')

Region    North  South
Product
Binder     20.0    NaN
Notebook    5.0    NaN
Pen         NaN   10.0

## 25.Which of the following  statement is /are True?
a) .iloc method includes include the last element when used for slicing

b).loc mrthod doesnot includes the last element when used fo slicing

c)We can use .loc method and pass default integer index of row when slicing 

d)None of above

##### c) We can use .loc method and pass the default integer index of the row when slicing.

* The .loc method can be used with the default integer index of the row when slicing. 
* For example, df.loc[0:3] would select rows with index 0, 1, 2, and 3.

## 26. using a pivot table is it possible to create a multi index dataframe ,if so what is  the syntax to have a multi index of data and Region  with total Product sold as value

In [45]:
df1.pivot_table(index=['Date', 'Region'], columns='Product', values='Quantity', aggfunc='sum')

Product            Binder  Notebook   Pen
Date       Region
2024-01-10 East       NaN       7.0   NaN
           North      NaN       5.0   NaN
2024-01-11 North     20.0       NaN   NaN
           South      NaN       NaN  10.0
2024-01-12 East      10.0       NaN   NaN
           West       NaN       NaN  15.0

## 27. what does the margins parameter in the pivot_table() function allowyou to include in the pivot table?

a) Additional margins and subtotals for rows and columns

b) A list of column name to exclude from to pivot table

c) The number of rows and columns to skip at the beginning of the pivot table

d)The maximum number of rows and columns to display in the pivot table

#### a) Additional margins and subtotals for rows and columns

* The margins parameter in the pivot_table() function allows you to include additional margins and subtotals for rows and  columns in the resulting pivot table.

In [31]:
import numpy as np

In [46]:
data = {
    'Fruits': ['apple', 'banana', 'apple', 'apple', 'banana', 'apple', 'kiwi',
               'kiwi', 'banana', 'apple', 'kiwi', 'apple', 'banana', 'grape',
               'apple', 'banana', 'apple', 'apple', 'apple'],
    'Price': [np.nan, np.nan, 205, 200, 40, 210, 300, 320, np.nan, 180, 350,np.nan, 35, np.nan, 215, 40, np.nan, np.nan, np.nan]
}

df2 = pd.DataFrame(data)

In [47]:
df2

    Fruits  Price
0    apple    NaN
1   banana    NaN
2    apple  205.0
3    apple  200.0
4   banana   40.0
5    apple  210.0
6     kiwi  300.0
7     kiwi  320.0
8   banana    NaN
9    apple  180.0
10    kiwi  350.0
11   apple    NaN
12  banana   35.0
13   grape    NaN
14   apple  215.0
15  banana   40.0
16   apple    NaN
17   apple    NaN
18   apple    NaN

## 28 . if we choose to impute missing value in  Price  col by chaining ffill() and bfill() while limiting the imputation to 1,1 respectively ,how many missing values will be left post imputation

In [48]:
df2['Price'] = df2['Price'].ffill(limit=1).bfill(limit=1)

In [49]:
rmv = df2['Price'].isnull().sum()
rmv

3

## 29.What kind of missing values handling technique is appropriate for df2?

a) Imputing Price col with Price's mean

b) Imputing Price col with Price's median

c)Imputing Price col with  individual friuts'Price median

d)Dropping missing values

##### (c) Imputing Price col with individual fruits' Price median

##### d)Dropping missing values

## 30 If we choose to impute missing values in Price col by with individual Fruits'Price's mean ,how many missing values will be post imputation

In [51]:
df2['Price'] = df2.groupby('Fruits')['Price'].transform(lambda x: x.fillna(x.mean()))
df2['Price'].isnull().sum()

0

## 31.if  a=pd.Series([np.nan,1,2,np.nan,np.nan,np.nan,np.nan,4,5,7]) what  will be  the output of a.interpolate

The interpolate function in pandas is used to fill NaN values using various interpolation methods

In [ ]:
a=pd.Series([np.nan,1,2,np.nan,np.nan,np.nan,np.nan,4,5,7])

In [ ]:
a.interpolate()

## what is the use of the normalization parameter in the crosstab method of pandas?

a) it used to normalize values by dividing them by the total count

b)to add margins

c) there is no parameter called as normalize in crosstab

d)both a & c

### a) It is used to normalize values by dividing them by the total count

The normalize parameter in the crosstab method of pandas allows you to normalize the values in the resulting cross-tabulation by dividing them by the total count. This is useful for obtaining relative frequencies or percentages instead of raw counts